In [3]:
import pandas as pd
import numpy as np

In [4]:
data = pd.DataFrame({'Column1': [1, 2, 'N/A', 4, 5],
        'Column2': [10, 'NA', 30, 40, 50]})
data

  Column1 Column2
0       1      10
1       2      NA
2     N/A      30
3       4      40
4       5      50

In [5]:
data.to_csv('data.csv',index=False)

In [6]:
data.isnull().sum()

Column1    0
Column2    0
dtype: int64

In [7]:
df = pd.read_csv('data.csv', na_values=['N/A', 'NA','None'])
df

   Column1  Column2
0      1.0     10.0
1      2.0      NaN
2      NaN     30.0
3      4.0     40.0
4      5.0     50.0

In [8]:
df.isnull().sum()

Column1    1
Column2    1
dtype: int64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  4 non-null      float64
 1   Column2  4 non-null      float64
dtypes: float64(2)
memory usage: 212.0 bytes

In [10]:
df.sample(2)

   Column1  Column2
2      NaN     30.0
4      5.0     50.0

In [11]:
df.head(2)

   Column1  Column2
0      1.0     10.0
1      2.0      NaN

In [12]:
df.tail(2)

   Column1  Column2
3      4.0     40.0
4      5.0     50.0

In [13]:
print('Total missing values in data:',df.isnull().sum().sum())

Total missing values in data: 2

In [14]:
missing_values = df.isnull().sum().sum()

In [15]:
print(f'Total missing values in data:{missing_values}')

Total missing values in data:2

In [16]:
var_1 = df.dropna()

In [17]:
var_1

   Column1  Column2
0      1.0     10.0
3      4.0     40.0
4      5.0     50.0

In [18]:
df

   Column1  Column2
0      1.0     10.0
1      2.0      NaN
2      NaN     30.0
3      4.0     40.0
4      5.0     50.0

In [19]:
df_cleaned = df.dropna()

In [20]:
df_cleaned

   Column1  Column2
0      1.0     10.0
3      4.0     40.0
4      5.0     50.0

In [21]:
df.dropna(inplace=True)

In [22]:
df

   Column1  Column2
0      1.0     10.0
3      4.0     40.0
4      5.0     50.0

In [23]:
df = pd.DataFrame({
                  'Order_ID': [101, 102, 103, 104, 105],
                  'Customer_Name': ['Alice', 'Bob', 'Charlie', None, 'Eve'],
                  'Product': ['Laptop', 'Keyboard', 'Monitor', 'Mouse', None],
                  'Quantity': [1, 2, np.nan, 4, 5],
                  'Price': [1000, 500, np.nan, 200, 300]
              })
df

   Order_ID Customer_Name   Product  Quantity   Price
0       101         Alice    Laptop       1.0  1000.0
1       102           Bob  Keyboard       2.0   500.0
2       103       Charlie   Monitor       NaN     NaN
3       104          None     Mouse       4.0   200.0
4       105           Eve      None       5.0   300.0

In [24]:
# Fill missing values in the 'Quantity' and 'Price' columns with the mean
df_filled = df.fillna({'Quantity': 10, 'Price': df['Price'].mean()})

In [25]:
df_filled

   Order_ID Customer_Name   Product  Quantity   Price
0       101         Alice    Laptop       1.0  1000.0
1       102           Bob  Keyboard       2.0   500.0
2       103       Charlie   Monitor      10.0   500.0
3       104          None     Mouse       4.0   200.0
4       105           Eve      None       5.0   300.0

In [26]:
df

   Order_ID Customer_Name   Product  Quantity   Price
0       101         Alice    Laptop       1.0  1000.0
1       102           Bob  Keyboard       2.0   500.0
2       103       Charlie   Monitor       NaN     NaN
3       104          None     Mouse       4.0   200.0
4       105           Eve      None       5.0   300.0

In [27]:
# Use linear interpolation to fill missing values
df_interpolated = df.interpolate()
df_interpolated

/var/folders/v6/tfg0h80n4dq87291tslqlg0r0000gn/T/ipykernel_78742/980070153.py:2: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df_interpolated = df.interpolate()

   Order_ID Customer_Name   Product  Quantity   Price
0       101         Alice    Laptop       1.0  1000.0
1       102           Bob  Keyboard       2.0   500.0
2       103       Charlie   Monitor       3.0   350.0
3       104          None     Mouse       4.0   200.0
4       105           Eve      None       5.0   300.0

In [28]:
import seaborn as sns

ModuleNotFoundError: No module named 'seaborn'

In [ ]:
sns.scatterplot(data=df,x='Price',y='Price')
sns.lineplot(data=df,x='Price',y='Price')

In [ ]:
df.isnull().sum()

In [ ]:
df['Quantity'].isnull()

In [ ]:
df[df['Quantity'].isnull()]

In [ ]:
df.iloc[1:4]

In [ ]:
# isi spesifik index
df.iloc[2,3] = 'None'

In [ ]:
df

In [ ]:
for index, i in enumerate(df['Quantity']):
    try:
        float(i)
    except:
        print(i)
        print(index)

In [ ]:
# Replace 'None' with 'Unknown' in column Product, row-4
df_replaced = df.replace(to_replace=[None], value='Unknown')
df_replaced

In [ ]:
# Sample data with duplicate rows
data = {
    'Order_ID': [101, 102, 103, 103, 104],
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'Charlie', 'Eve'],
    'Product': ['Laptop', 'Keyboard', 'Monitor', 'Monitor', 'Mouse'],
    'Quantity': [1, 2, 1, 1, 1],
    'Price': [1000, 500, 300, 300, 200]
}

df = pd.DataFrame(data)
df

In [ ]:
df

In [ ]:
df.duplicated().sum()

In [ ]:
df[df['Order_ID'].duplicated()]

In [ ]:
df_cleaned = df.drop_duplicates(keep='last')
df_cleaned

In [ ]:
# Sample sales transaction data
data = {
    'Order_ID': [101, 102, 103, 104, 105],
    'Date': ['2023-07-15', '2023-07-16', '2023-07-17', '2023-07-18', '2023-07-19'],
    'Customer_ID': ['C001', 'C002', 'C003', 'C004', 'C005'],
    'Product': ['Laptop', 'Keyboard', 'Monitor', 'Mouse', 'Headphones'],
    'Quantity': ['1', '2', '3', '4', '5'],
    'Price': ['1000.50', '250.25', '350.75', '75.20', '120.99']
}
data

In [ ]:

df = pd.DataFrame(data)
df

In [ ]:
df.info()

In [ ]:
df['Date'] = pd.to_datetime(df['Date'])
print(df.dtypes)

In [ ]:
df.set_index(df['Date'],inplace=True)

In [ ]:
df

In [ ]:
df.loc['2023-07-18']

In [ ]:
df['Price'] = df['Price'].astype(float)

In [ ]:
df.info()

In [ ]:
df['Price'].plot(kind='line')

In [ ]:
df['Quantity'] = df['Quantity'].astype(int)
print(df.dtypes)

In [ ]:
df = pd.DataFrame({
    'Transaction_ID': [101, 102, 103, 104, 105],
    'Customer_Name': ['  John Doe  ', 'Alice', '  Bob  ', 'Charlie', 'Eve'],
    'Product_Description': ['Laptop Asus Core i5', 'Keyboard Logitech', 'Monitor Samsung', 'Mouse HP', 'Headphones Sony']
})

df

In [ ]:
# Remove leading/trailing whitespaces from 'Customer_Name' and 'Product_Description'
df['Customer_Name'] = df['Customer_Name'].str.strip()
df['Product_Description'] = df['Product_Description'].str.strip()
df

In [ ]:
df['Customer_Name'] = df['Customer_Name'].str.upper()

In [ ]:
df

In [ ]:
# Remove 'Core i5' from 'Product_Description'
df['Product_Description'] = df['Product_Description'].str.replace('Core i5', '')

# Replace 'Sony' with 'Sony Corporation' in 'Product_Description'
df['Product_Description'] = df['Product_Description'].str.replace('Sony', 'Sony Corporation')

df

In [ ]:
print(type(df['Product_Description']))
df['Product_Description']

In [ ]:
print(type(df[['Product_Description']]))
df[['Product_Description']]

In [ ]:
# Split 'Product_Description' into two separate columns
df['Product_Description'][:].str.split(' ', n=8, expand=True)

In [ ]:
data = {
    'Order_ID': [101, 102, 103, 104, 105],
    'Date_Time': ['2023-07-15 10:30:00', '2023-07-16 15:45:00', '2023-07-17 12:00:00', '2023-07-18 09:00:00', '2023-07-19 16:20:00'],
    'Customer_ID': ['C001', 'C002', 'C003', 'C004', 'C005'],
    'Product': ['Laptop', 'Keyboard', 'Monitor', 'Mouse', 'Headphones'],
    'Quantity': [1, 2, 3, 4, 5],
    'Price': [1000, 250, 350, 75, 120]
}

df = pd.DataFrame(data)
df['Date_Time'] = pd.to_datetime(df['Date_Time'])

df

In [ ]:
# Extract year, month, and day from 'Date_Time'
df['Year'] = df['Date_Time'].dt.year
df['Month'] = df['Date_Time'].dt.month
df['Day'] = df['Date_Time'].dt.day

df[['Date_Time', 'Year', 'Month', 'Day']]

In [ ]:
data_1 = {
    'Name':['budi','joko','bambang'],
    'Price':['Rp 10000','Rp 9000','Rp 70000']
}

new_data_1 = pd.DataFrame(data_1)

In [ ]:
new_data_1['Price'][0][3:]

In [ ]:
list_1 = []
for i in new_data_1['Price']:
    list_1.append(int(i[3:]))

In [ ]:
new_data_1['Price'] = list_1

In [ ]:
new_data_1

In [ ]:
new_data_1.info()

In [ ]:
df[['Date_Time']]

In [ ]:
# Format 'Date_Time' to a specific format (e.g., "yyyy-mm-dd HH:MM")
df['Formatted_Date'] = df['Date_Time'].dt.strftime('%Y-%m-%d %H:%M')

df[['Date_Time', 'Formatted_Date']]

In [ ]:
from datetime import datetime

In [ ]:
# Calculate time difference from the current time
current_time = datetime.now()
df['Time_Difference'] = current_time - df['Date_Time']

df[['Date_Time', 'Time_Difference']]

In [ ]:
# Calculate time difference from the current time
current_time = pd.to_datetime('2023-07-20 10:00:00')
df['Time_Difference'] = current_time - df['Date_Time']

df[['Date_Time', 'Time_Difference']]

In [ ]:
# Assuming the original datetime is in UTC and we want to convert it to Jakarta timezone (Asia/Jakarta)
df['Date_Time_Jakarta'] = df['Date_Time'].dt.tz_localize('UTC').dt.tz_convert('Asia/Jakarta')

df[['Date_Time', 'Date_Time_Jakarta']]

In [ ]:
df[['Date_Time', 'Date_Time_Jakarta']].info()

In [ ]:
!wget 'https://github.com/FTDS-learning-materials/phase-0/raw/main/src/travel%20insurance.csv'

In [ ]:
pd.read_csv('https://github.com/FTDS-learning-materials/phase-0/raw/main/src/travel%20insurance.csv')

In [ ]:
data_1 = pd.read_excel('clean.xlsx',sheet_name='Countries Summary')

In [ ]:
data_1

In [ ]:
data_2 = pd.read_excel('clean.xlsx',sheet_name='Offline')

In [ ]:
data_2

In [ ]:
data_3 = pd.read_excel('clean.xlsx',sheet_name='Online')

In [ ]:
data_3

In [ ]:
city_revenues = pd.Series(
    [4200, 8000, 6500],
    index=["Amsterdam", "Toronto", "Tokyo"]
)
city_employee_count = pd.Series({"Amsterdam": 5, "Tokyo": 8})

further_city_data = pd.DataFrame(
    {"revenue": [7000, 3400], "employee_count": [2, 2]},
    index=["New York", "Barcelona"]
)

city_data = pd.DataFrame({
    "revenue": city_revenues,
    "employee_count": city_employee_count
})

In [ ]:
further_city_data

In [ ]:
city_data

In [ ]:
all_city_data = pd.concat([city_data, further_city_data], sort=True)
all_city_data

In [ ]:
all_city_data = pd.concat([city_data, further_city_data],axis=0)
all_city_data

In [ ]:
city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]},
    index=["Amsterdam", "Tokyo", "Rotterdam", "Toronto", "Barcelona"]
)

city_countries

In [ ]:
cities = pd.concat([all_city_data, city_countries], axis=1, sort=False)
cities

In [ ]:
countries = pd.DataFrame({
    "population_millions": [17, 127, 37],
    "continent": ["Europe", "Asia", "North America"]
}, index=["Holland", "Japan", "Canada"])

In [ ]:
countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [ ]:
cities

NameError: name 'cities' is not defined

In [ ]:
pd.merge(cities, countries, left_on="country", right_index=True)

In [ ]:
pd.merge(cities, countries, left_on="country", right_on=countries.index)

In [ ]:
df[(df['Day']==16) | (df['Day']>1)]